# IFCFamilyInstanceExtrusionExportResults Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IFCFamilyInstanceExtrusionExportResults Properties
IFCFamilyInstanceExtrusionExportResults Class See Also
---
The IFCFamilyInstanceExtrusionExportResults type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ExtraOffset | The extra offset determined from the geometry of the family instance. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| MaterialId | The best material id determined for the family instance. |

# See Also
IFCFamilyInstanceExtrusionExportResults Class
Autodesk.Revit.DB.IFC Namespace